create_clock -period 50.000 -name virtual_clock -waveform {0.000 25.000}
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {A[0]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 5.000 [get_ports {A[0]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports Cout]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 5.000 [get_ports Cout]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {S[0]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 5.000 [get_ports {S[0]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {S[1]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 5.000 [get_ports {S[1]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {S[2]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 5.000 [get_ports {S[2]}]
set_output_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {S[3]}]
set_output_delay -clock [get_clocks virtual_clock] -max -add_delay 5.000 [get_ports {S[3]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {A[1]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 5.000 [get_ports {A[1]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {A[2]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 5.000 [get_ports {A[2]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {A[3]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 5.000 [get_ports {A[3]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {B[0]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 5.000 [get_ports {B[0]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {B[1]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 5.000 [get_ports {B[1]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {B[2]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 5.000 [get_ports {B[2]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports {B[3]}]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 5.000 [get_ports {B[3]}]
set_input_delay -clock [get_clocks virtual_clock] -min -add_delay 1.000 [get_ports Cin]
set_input_delay -clock [get_clocks virtual_clock] -max -add_delay 5.000 [get_ports Cin]



set_property PACKAGE_PIN W5 [get_ports {A[0]}]
set_property PACKAGE_PIN W6 [get_ports {A[1]}]
set_property PACKAGE_PIN W7 [get_ports {A[2]}]
set_property PACKAGE_PIN W8 [get_ports {A[3]}]
set_property PACKAGE_PIN T19 [get_ports {S[3]}]
set_property PACKAGE_PIN T18 [get_ports {S[2]}]
set_property PACKAGE_PIN T17 [get_ports {S[1]}]
set_property PACKAGE_PIN T16 [get_ports {S[0]}]
set_property PACKAGE_PIN T21 [get_ports Cout]
set_property PACKAGE_PIN W10 [get_ports Cin]
set_property PACKAGE_PIN U9 [get_ports {B[3]}]
set_property PACKAGE_PIN U7 [get_ports {B[2]}]
set_property PACKAGE_PIN U6 [get_ports {B[1]}]
set_property PACKAGE_PIN U5 [get_ports {B[0]}]
